## Zeyad Khaled Ehab

# What is Pandas?
Pandas is an open-source data analysis and data manipulation library built on top of Numpy.
It provides high-level data structures and functions designed to make data analysis fast and
easy in Python.

**Creating panadas data structure**

In [15]:
#importing the library before starting using it
import pandas as pd

In [17]:
#to create a series from a list or converting
series = pd.Series([10, 20, 30, 40, 50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

**Data Frame**

A DataFrame is a two-dimensional labeled data structure
with columns of potentially different types. It is similar to a
table in a database or a data frame in R.

data frame from dictionary

In [ ]:
data = {
    "name" : ["alice", "bob", "charlie"],
    "city" : ["new york", "los angeles", "chicago"],
    "age" : [25, 30, 35]
}
#this cmmand is to convert dictinary to data frame 
df = pd.DataFrame(data)
print(df)

      name         city  age
0    alice     new york   25
1      bob  los angeles   30
2  charlie      chicago   35

The head() method returns the first five rows of the
DataFrame. This is useful for quickly examining the top of
a dataset.

In [20]:
# if you have a big data yu could view nly first few rws by this cmmand
df.head()

      name         city  age
0    alice     new york   25
1      bob  los angeles   30
2  charlie      chicago   35

The info() method provides a summary of the DataFrame,
including the number of non-null entries and the data type
of each column

In [21]:
#to get the data full information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   city    3 non-null      object
 2   age     3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

The describe() method generates descriptive statistics,
such as mean, standard deviation, min, and max, for
numerical columns.

In [23]:
"""
easily we can call it the statistical describation of the data like mean, standard deviation, min, and max, for
numerical columns
"""
df.describe()

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [25]:
#the same as select command in sql it's used t show only selected data
print(df["name"])

0      alice
1        bob
2    charlie
Name: name, dtype: object

In [27]:
#can be als used based on condition
df_filtered = df[df["age"] > 30]
print(df_filtered)

      name     city  age
2  charlie  chicago   35

The loc[] method is used for label-based indexing to select
specific rows and columns. Here, rows with indices 0 and
1 and columns 'Name' and 'City' are selected

In [28]:
# you can specify rows or coloums
data_wanted = df.loc[0:1, ["name", "city"]]
print(data_wanted)

    name         city
0  alice     new york
1    bob  los angeles

ilc fr postinal index

In [29]:
#iloc

In [35]:
"""
iloc use index insted f the value
data_wanted = df.iloc["a":"b", ["name", "city"]]
print(data_wanted)
"""

'\niloc use index insted f the value\ndata_wanted = df.iloc["a":"b", ["name", "city"]]\nprint(data_wanted)\n'

**Data Modification**

adding new coloumn

In [34]:
df["salary"] = [7000, 8000, 9000]
print(df)

      name         city  age  salary
0    alice     new york   25    7000
1      bob  los angeles   30    8000
2  charlie      chicago   35    9000

updating data in coloumns

In [36]:
df["age"]= df["age"] + 5
print(df)

      name         city  age  salary
0    alice     new york   30    7000
1      bob  los angeles   35    8000
2  charlie      chicago   40    9000

dropping a coloumn

The drop() method removes the 'City' column from the
DataFrame. The axis=1 argument specifies that a column
is being dropped.

In [37]:
df = df.drop("city", axis = 1)
print(df)

      name  age  salary
0    alice   30    7000
1      bob   35    8000
2  charlie   40    9000

In [38]:
#if the axis is not specified it will be =0 
#0 for rows and 1 fr coloumns

axis{0 or ‘index’, 1 or ‘columns’}, default 0
Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’)

**Handling Missing Data**

In [39]:
df_with_nan = pd.DataFrame({"A":[1, 2, None], "B": [4, None, 6]})
print(df_with_nan)

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

The isnull() method detects missing values in the
DataFrame and returns a DataFrame of the same shape
with True or False values.

In [40]:
#is null is a command to specify the null values 
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [42]:
df_with_nan = pd.DataFrame({"A":[1, 2, None], "B": [None, None, 6]})
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  NaN  6.0

In [43]:
df_with_nan.isnull()

       A      B
0  False   True
1  False   True
2   True  False

In [44]:
#.sum() a command  that's sum the null values in each coloumn
df_with_nan.isnull().sum()

A    1
B    2
dtype: int64

In [46]:
df_with_nan.isnull().sum().sum()

np.int64(3)

**filling missing values**

The fillna() method replaces missing values with a
specified value, such as 0. This is useful for cleaning
datasets before analysis.

In [47]:
#fillna(here is the value yo wanna replace the none with)
df_with_nan.fillna(0)

     A    B
0  1.0  0.0
1  2.0  0.0
2  0.0  6.0

In [48]:
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  NaN  6.0

In [49]:
df_with_nan["A"] = df_with_nan["A"].fillna(df_with_nan["A"].mean())

In [50]:
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  1.5  6.0

In [52]:
df_with_nan["B"] = df_with_nan["B"].fillna(df_with_nan["B"].mean())
df_with_nan

     A    B
0  1.0  6.0
1  2.0  6.0
2  1.5  6.0

In [53]:
student_dict = {"Name": ["Joe", "Ali", "Baraa", "Tala"], "Age": [20, None, 40, 35], "Marks": [None, None, 95, 80]}

In [55]:
#creating Data Frame from a student dict 
student_df = pd.DataFrame(student_dict)

In [56]:
student_df

    Name   Age  Marks
0    Joe  20.0    NaN
1    Ali   NaN    NaN
2  Baraa  40.0   95.0
3   Tala  35.0   80.0

In [58]:
#to change the index frm 0 1 2 to be a b c 
student_dict = {"Name": ["Joe", "Ali", "Baraa", "Tala"], "Age": [20, None, 40, 35], "Marks": [None, None, 95, 80]}
student_df = pd.DataFrame(student_dict, index=["a", "b", "c", "d"])
student_df

    Name   Age  Marks
a    Joe  20.0    NaN
b    Ali   NaN    NaN
c  Baraa  40.0   95.0
d   Tala  35.0   80.0

In [59]:
# to calc mean 
student_df["Marks"].mean()

np.float64(87.5)

In [60]:
# filling the missing vlaues based n the mean value 
student_df["Marks"].fillna(student_df["Marks"].mean())

a    87.5
b    87.5
c    95.0
d    80.0
Name: Marks, dtype: float64

In [65]:
#dropping rws with missing values
df_with_nan = pd.DataFrame({"A":[1, 2, None], "B": [4,None, 6]})
df_with_nan.isnull()

       A      B
0  False  False
1  False   True
2   True  False

In [66]:
cleaned_df = df_with_nan.dropna()

In [67]:
print(cleaned_df)

     A    B
0  1.0  4.0

**Grouping and aggregation**

In [68]:
data = {
    "name" : ["alice", "bob", "charlie"],
    "city" : ["new york", "los angeles", "chicago"],
    "age" : [25, 30, 35]
}

df["salary"] = [7000, 8000, 9000]
print(df)

      name  age  salary
0    alice   30    7000
1      bob   35    8000
2  charlie   40    9000

The apply() method is used to apply a custom function to
each element in a column. Here, it doubles the salary for
each employee.

In [69]:
#a functin to double the salary 
def double_salary(x):
    return x*2
df["Double_salary"] = df["salary"].apply(double_salary)
print(df)

      name  age  salary  Double_salary
0    alice   30    7000          14000
1      bob   35    8000          16000
2  charlie   40    9000          18000

**Grouping**

In [71]:
df = pd.DataFrame({"Department": ["HR", "IT", "HR", "IT"], 
                   "Salary": [50000, 60000, 45000, 80000]})
df

  Department  Salary
0         HR   50000
1         IT   60000
2         HR   45000
3         IT   80000

In [72]:
grouped = df.groupby("Department").mean()
print(grouped)

             Salary
Department
HR          47500.0
IT          70000.0

In [73]:
avg_salary = df.groupby("Department")["Salary"].mean()
print(avg_salary)

Department
HR    47500.0
IT    70000.0
Name: Salary, dtype: float64

In [74]:
avg_salary.head()

Department
HR    47500.0
IT    70000.0
Name: Salary, dtype: float64

## Done